<?php
$a[]="Беларусь";
$a[]="Австрия";
$a[]="Албания";
$a[]="Бельгия";
$a[]="Венгрия";
$a[]="Венесуэла";
$a[]="Ирландия";
$a[]="Исландия";
$a[]="Россия";
$a[]="Бразилия";
$a[]="Канада";
$a[]="Казахстан";
$a[]="Китай";
$a[]="Киргизия";
$a[]="США";
$a[]="Нидерланды";
$a[]="ЮАР";
$a[]="Польша";
$a[]="Австралия";
$a[]="Германия";
$a[]="Великобритания";
$a[]="Испания";

$s = preg_replace("/[\. \(\)\-]/", "", $_REQUEST['s']);
$response="";
if (strlen($s) > 0)
{
	for($i = 0; $i<count($a); $i++)
  	{
  		if (strtolower($s) == strtolower(substr($a[$i],0,strlen($s))))
    	{
    		if ($response == "")
      		{
      			$response=$a[$i];
      		}
    		else
      		{
      			$response=$response." , ".$a[$i];
      		}
    	}
  	}
}

echo $response;
?>